In [8]:
## Importing libraries and connecting SQL server 
import pandas as pd
import numpy as np

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql

pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

username = 'root' # default username for MySQL db is root
password = 'Rocp137a7bc'

connection = f'mysql+pymysql://{username}:{password}@localhost/books'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books)

 ![png](books2.png)

In [10]:
## Creating database
create_database(connection)
database_exists(connection)

True

In [24]:
## Adding table to database
df_author = pd.read_csv("data/authors.csv")
df_author.to_sql('author', engine, if_exists = 'replace')
df_author.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [25]:
## Adding table to database
df_authortobook = pd.read_csv("data/favorites.csv")
df_authortobook.to_sql('favorites', engine, if_exists = 'replace')
df_authortobook.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [26]:
## Adding table to database
df_book = pd.read_csv("data/books.csv")
df_book.to_sql('books', engine, if_exists = 'replace')
df_book.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [27]:
## Adding table to database
df_user = pd.read_csv("data/User.csv")
df_user.to_sql('user', engine, if_exists = 'replace')
df_user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [21]:
q = '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_books
0          author
1    authortobook
2            book
3            user

In [30]:
q2 = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"));
'''
pd.read_sql(q2, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1